// 正则表达式

export default {
  // 1-64位中英文
  NAME_NORMAL: /^[\S ]{1,64}$/,
  // 邮箱正则
  EMAIL_REG: /^[a-zA-Z0-9][a-zA-Z0-9_.-]*@[a-zA-Z0-9_.-]*(\.[a-zA-Z0-9_-]+)+$/,
  // 手机验证
  PHONE_REG: /^\d{6,11}$/,
  // 用户名验证
  NAME_REG: /^[a-zA-Z][a-zA-Z\d_]{0,63}$/,
  // 密码正则 必须包含字母数字和特殊字符!@#%&,.?-_+
  PASSWORD: /^(?=.*\d)(?=.*[a-zA-Z])(?=.*[!\-@#%&,_+?.])[\da-zA-Z!\-@#%&,_+?.]{3,}$/,
  // 找回密码密码规则
  PASSWORD_RESET: /^(?=.*\d)(?=.*[a-zA-Z])(?=.*[!\-@#%&,_+?.])[\da-zA-Z!\-@#%&,_+?.]{8,25}$/,
  // 不能包含空格
  PASSWORD_Space: /^[^\s]+$/,
  // 长度为8~25位个字符
  PASSWORD_LENGTH: /^.{8,25}$/,
  // 必须包含字母、 数字、符号
  PASSWORD_MUST_INCLUDE: /^(?=.*\d)(?=.*[a-zA-Z])(?=.*[!\-@#%&,_+?.])[\da-zA-Z\s!\-@#%&,_+?.]{1,}$/,
  // 网页地址正则
  WEB_URL: /^(http|https|ftp|file|rtmp|rtsp):\/\/([a-zA-Z0-9-_])+\.(.+)+$/,
  // 自定义字段值验证
  CUSTOM_VALUE: /^(?!([*:<>/\\|"?、\s]))((?![*:<>/\\|"?、]).){0,64}$/g,
  // 协议头
  PROTOCOL: /^(http|https|ftp|file|rtmp|rtsp):\/\//,
  // 描述正则0~255位字符
  DESCRIPT_LENGTH: /^.{0,256}$/m,
  // 域名： 组织信息管理公司网址，了解更多网址，登录网址;系统设置（SMTP 服务器地址）, todo 域名格式为通用格式，不需要修改
  LOGIN_WEBSITE: /^(([A-Za-z0-9-~]+)\.)+([A-Za-z0-9-~/])*$/,
  // 用户名规则,长度为1-64位,支持字母、数字、下划线，必须以字母开头
  USERNAME: /^[a-zA-Z][a-zA-Z\d_]{0,63}$/,
  // 用户名规则,长度为1-64位
  USERNAME_LENGTH: /^.{1,64}/,
  // 用户名规则,支持字母、数字、下划线
  USERNAME_REG: /^[a-zA-Z\d_]*$/,
  // 用户名规则，必须以字母开头
  USERNAME_START: /^[a-zA-Z]/,
  // 匹配前三位，后三位，其余用*替代
  USERNAME_ABBR: /^(.{3})(.*)(.{3})$/,
  // 认证密码
  CERTIFY_USERNAME_PASSWORD: /^(?![0-9]+$)(?![a-zA-Z]+$)[-0-9A-Za-z]{6,18}$/,
  // 统一社会信用代码
  UNIFORM_SOCIAL_CREDIT_CODE: /^[^\u4e00-\u9fa5]{18,18}$/, //  /^(([^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10})|([0-9a-zA-Z]{9}))$/,
  // 邮政编码
  ZIP_CODE: /^[0-9]{6}$/,
  // 正整数（>=0）
  POSITIVE_INTEGER: /^([1-9]\d*|[0]{1,1})$/,
  // 正数（>=0），保留两位小数
  POSITIVE_NUM_TWO_DIG: /^(([0]{1,1})|([1-9][0-9]*)|(([0]\.\d{1,2}|[1-9][0-9]*\.\d{1,2})))$/,
  // 保留两位小数
  ALL_NUM_TWO_DIG: /^[-]?(([0]{1,1})|([1-9][0-9]*)|(([0]\.\d{1,2}|[1-9][0-9]*\.\d{1,2})))$/,
  // 只能0或1
  ZERO_OR_ONE: /^[0-1]{0,1}$/
}
